Rails/movieApp/app/views/movies/_form.html.erb

    <%= f.label :genre_id %><br>
    <%= f.collection_select:genre_id,Genre.all,:id,:name %>
---
SELECT "genres".* FROM "genres"