Rails/movieApp/app/views/genres/show.html.erb


<% @genre.movies.each do |movies| %>
---
SELECT "movies".* FROM "movies" WHERE "movies"."genre_id" = ?  [["genre_id", 1]]